/*********************************************************************************************************
* 模块名称: PolynomialFit.c
* 摘    要: 多项式拟合
* 当前版本: 1.0.0
* 作    者: SZLY(COPYRIGHT 2019 SZLY. All rights reserved.)
* 完成日期: 2019年08月01日
* 内    容: 
* 注    意: 
**********************************************************************************************************
* 取代版本: 
* 作    者: 
* 完成日期: 
* 修改内容: 
* 修改文件: 
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "PolynomialFit.h"
#include "stdio.h"
#include <math.h>

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define OLDER_MAX 10  //不宜太大，否则SRAM没有足够的内存使用

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: CalcPolynomial
* 函数功能: 计算多项式结果
* 输入参数: a-多项式系数，按照升幂排序，x-自变量，older-多项式阶数
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年01月01日
* 注		意:
*********************************************************************************************************/
double CalcPolynomial(double* a, double x, unsigned char older)
{
  double b[100];
  double result = 0;
  int i = 0;

  //求x的N次幂
  for (i = 0; i <= older; i++)
  {
    if (0 == i)
    {
      b[i] = 1;
    }
    else
    {
      b[i] = b[i - 1] * x;
    }
  }

  //求多项式结果
  for (i = 0; i <= older; i++)
  {
    result += a[i] * b[i];
  }

  return result;
}

/*********************************************************************************************************
* 函数名称: CalcPolyIntegral
* 函数功能: 计算多项式积分
* 输入参数: a-多项式系数，按照升幂排序，x1、x2-积分区域，older-多项式阶数
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年01月01日
* 注		意: 最大支持199次幂
*********************************************************************************************************/
double CalcPolyIntegral(double* a, double x1, double x2, unsigned char older)
{
  double b[100] = { 0 };  //原函数系数,最大支持199次幂
  double i = 0;
  double y1;
  double y2;
  double result;

  //求原函数系数
  b[0] = 0;
  for (i = 1; i <= (double)older + 1; i = i + 1)
  {
    b[(int)i] = a[(int)(i - 1)] / i;
  }

  //求解积分
  y1 = CalcPolynomial(b, x1, older + 1);
  y2 = CalcPolynomial(b, x2, older + 1);
  result = y2 - y1;

  return result;
}

/*********************************************************************************************************
* 函数名称: FindMaxInPolynomial
* 函数功能: 查找多项式最大值位置
* 输入参数: a-多项式系数，按照升幂排序，x1、x2-查找区域，older-多项式阶数，gap-查找起始位置
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年01月01日
* 注		意: 
*********************************************************************************************************/
double FindMaxInPolynomial(double* a, double x1, double x2, unsigned char older, double gap)
{
  double maxIndex = 0;  //最大值所处位置
  double maxOld = 0;
  double maxNew = 0;
  double i = 0;
  double temp;

  //从小到大查找
  if (x1 > x2)
  {
    temp = x1;
    x1 = x2,
      x2 = temp;
  }

  for (i = x1; i <= x2; i = i + gap)
  {
    maxNew = CalcPolynomial(a, i, older);

    //查找最大值
    if (maxNew > maxOld)
    {
      maxOld = maxNew;
      maxIndex = i;
    }
  }

  return maxIndex;
}

/*********************************************************************************************************
* 函数名称: FindFirstMaxInPolynomial
* 函数功能: 查找曲线第一个峰值
* 输入参数: a-多项式系数，按照升幂排序，x1、x2-查找区域，older-多项式阶数，gap-查找起始位置
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年01月01日
* 注		意:
*********************************************************************************************************/
double FindFirstMaxInPolynomial(double* a, double x1, double x2, unsigned char older, double gap)
{
  double maxIndex = 0;  //最大值所处位置
  double maxOld = 0;
  double maxNew = 0;
  double i = 0;
  double temp;

  //从小到大查找
  if (x1 > x2)
  {
    temp = x1;
    x1 = x2,
    x2 = temp;
  }

  for (i = x1; i <= x2; i = i + gap)
  {
    maxNew = CalcPolynomial(a, i, older);

    //查找第一个峰值
    if (maxNew > maxOld)
    {
      maxOld = maxNew;
      maxIndex = i;
    }
    else if (maxNew < maxOld)
    {
      break;
    }
  }

  return maxIndex;
}

/*********************************************************************************************************
* 函数名称: PolynomialFit
* 函数功能: 拟合多项式
* 输入参数: x-数据自变量
*            y-数据因变量
*            outPut-输出系数，按照升幂排序
*            maxn-拟合数据量
*            older-拟合阶数
* 输出参数: void
* 返 回 值: void
* 创建日期: 2018年01月01日
* 注		意: outPut按照升序排序，每次拟合之前outPut缓冲区应初始化为0，否则拟合会出现异常
*********************************************************************************************************/
void PolynomialFit(double* x, double* y, double* outPut, int maxn, unsigned char older)
{
  double buf1[2 * (OLDER_MAX + 1)] = { 0 };
  double buf2[OLDER_MAX + 1][OLDER_MAX + 1];
  int i, j, k;
  int column;
  double mainelement;
  double atemp2;
  double btemp;
  double Mik;
  double sum;

  //清空输出缓冲区
  for (i = 0; i <= older; i++)
  {
    *(outPut + i) = 0;
  }

  for (i = 0; i < maxn; i++) 
  { 
    for (j = 1; j < 2 * (older + 1); j++)
    {
      buf1[j] += pow(x[i], j);
    }

    for (j = 0; j <= older; j++)
    {
      outPut[j] += pow(x[i], j) * y[i];
    }
  }
  buf1[0] = maxn;

  //构建线性方程组系数矩阵，b[]不变
  for (i = 0; i < older + 1; i++)
  {
    k = i;
    for (j = 0; j < older + 1; j++)
    {
      buf2[i][j] = buf1[k++];
    }
  }

  //以下为高斯列主元消去法解线性方程组
  for (k = 0; k < older + 1 - 1; k++)
  {  //n - 1列
    column = k;
    mainelement = buf2[k][k];

    //找主元素
    for (i = k; i < older + 1; i++)
    {
      if (fabs(buf2[i][k]) > mainelement)
      {
        mainelement = fabs(buf2[i][k]);
        column = i;
      }
    }

    //交换两行
    for (j = k; j < older + 1; j++)
    {
      atemp2 = buf2[k][j];
      buf2[k][j] = buf2[column][j];
      buf2[column][j] = atemp2;
    }
    btemp = outPut[k];
    outPut[k] = outPut[column];
    outPut[column] = btemp;

    //消元过程
    for (i = k + 1; i < older + 1; i++)
    {
      Mik = buf2[i][k] / buf2[k][k];
      for (j = k; j < older + 1; j++)
      {
        buf2[i][j] -= Mik * buf2[k][j];
      }
      outPut[i] -= Mik * outPut[k];
    }
  }

  //回代过程
  outPut[older + 1 - 1] /= buf2[older + 1 - 1][older + 1 - 1];
  for (i = older + 1 - 2; i >= 0; i--)
  {
    sum = 0;
    for (j = i + 1; j < older + 1; j++)
    {
      sum += buf2[i][j] * outPut[j];
    }
    outPut[i] = (outPut[i] - sum) / buf2[i][i];
  }
  //高斯列主元消去法结束

  //输出matlab格式
  printf("P(x) = %f", outPut[0]);
  for (i = 1; i <= older; i++)
  {
    printf("%+f.*x.^%d", outPut[i], i);
  }
  printf("\r\n");

}
