/*********************************************************************************************************
* 模块名称：UART0.c
* 摘    要：串口模块，包括串口模块初始化，以及中断服务函数处理，以及读写串口函数实现
* 当前版本：1.0.0
* 作    者：SZLY(COPYRIGHT 2018 - 2020 SZLY. All rights reserved.)
* 完成日期：2020年01月01日 
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "UART0.h"
#include "Queue.h"
#include "gr55xx_hal.h"


#include "boards.h"
//#include "gus.h"
/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
uart_handle_t g_uart_handle;
/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/           

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/    
static  StructCirQue s_structUARTRecCirQue;       //接收串口循环队列
static unsigned char s_arrRecBuf[UART0_BUF_SIZE]; //接收串口循环队列的缓冲区

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static  void  ConfigUART(u32 bound);  //配置串口相关的参数，包括GPIO、RCC、USART和NVIC 
  
/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/

/*********************************************************************************************************
* 函数名称：ConfigUART
* 函数功能：配置串口相关的参数，包括GPIO、RCC、USART和NVIC  
* 输入参数：bound，波特率
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
static  void  ConfigUART(u32 bound)
{  
  gpio_init_t gpio_config = GPIO_DEFAULT_CONFIG;

  gpio_config.mode = GPIO_MODE_MUX;                 //引脚复用模式
  
  gpio_config.pin  = GPIO_PIN_3;
  gpio_config.mux  = GPIO_MUX_0;         //复用模式0：串口UART0的TX
  hal_gpio_init(GPIO0, &gpio_config);

  gpio_config.pin  = GPIO_PIN_4;
  gpio_config.mux  = GPIO_MUX_0;
  hal_gpio_init(GPIO0, &gpio_config);
  
  g_uart_handle.p_instance           = UART0;
  g_uart_handle.init.baud_rate       = bound;
  g_uart_handle.init.data_bits       = UART_DATABITS_8;
  g_uart_handle.init.stop_bits       = UART_STOPBITS_1;
  g_uart_handle.init.parity          = UART_PARITY_NONE;
  g_uart_handle.init.hw_flow_ctrl    = UART_HWCONTROL_NONE;
  g_uart_handle.init.rx_timeout_mode = UART_RECEIVER_TIMEOUT_ENABLE;
  
  hal_nvic_enable_irq(UART0_IRQn);     //使能中断

  hal_uart_deinit(&g_uart_handle);
  hal_uart_init(&g_uart_handle);
  
  
  hal_uart_rx_cplt_callback(&g_uart_handle);   //开启数据传输（防止首字节丢失）
}

/*********************************************************************************************************
* 函数名称：USART0_IRQHandler
* 函数功能：USART0中断服务函数 
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void UART0_IRQHandler(void)
{
  hal_uart_irq_handler(&g_uart_handle);
}


void hal_uart_rx_cplt_callback(uart_handle_t *p_uart)   //硬件对应缓冲区中存在数据就会进入
{
  static uint8_t uData = 0;                  //不加static,下面获取数据一直是\0
  
  hal_uart_receive_it(&g_uart_handle, &uData, 1);
  
  
  EnQueue(&s_structUARTRecCirQue, &uData, 1);           //将接收到的数据写入接收缓冲区
  
// hal_uart_transmit_it(&g_uart_handle, &uData, 1);
   
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitUART0
* 函数功能：初始化UART模块 
* 输入参数：bound,波特率
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void InitUART0(u32 bound)
{
  InitQueue(&s_structUARTRecCirQue,  s_arrRecBuf,  UART0_BUF_SIZE); //初始化串口缓冲区
                  
  ConfigUART(bound);                                                //配置串口相关的参数，包括GPIO、RCC、USART和NVIC  
}

/*********************************************************************************************************
* 函数名称：WriteUART0
* 函数功能：写串口，即写数据到的串口发送缓冲区  
* 输入参数：pBuf，要写入数据的首地址，len，期望写入数据的个数
* 输出参数：void
* 返 回 值：成功写入数据的个数，不一定与形参len相等
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void WriteUART0(u8 *pBuf, u8 len)
{
  hal_uart_transmit(&g_uart_handle, pBuf, len,50);  
}

/*********************************************************************************************************
* 函数名称：ReadUART0
* 函数功能：读串口，即读取串口接收缓冲区中的数据  
* 输入参数：pBuf，读取的数据存放的首地址，len，期望读取数据的个数
* 输出参数：pBuf，读取的数据存放的首地址
* 返 回 值：成功读取数据的个数，不一定与形参len相等
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
u8  ReadUART0(u8 *pBuf, u8 len)
{                      
  return DeQueue(&s_structUARTRecCirQue, pBuf, len);
}
    
/*********************************************************************************************************
* 函数名称：fputc
* 函数功能：重定向函数  
* 输入参数：ch，f
* 输出参数：void
* 返 回 值：int 
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
int fputc(int ch, FILE* f)
{
  hal_uart_transmit(&g_uart_handle, (uint8_t *)&ch, 1,50); 

  return ch;  
}
