/*********************************************************************************************************
* 模块名称：QueueCommon.h
* 摘    要：通用Queue模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日
* 内    容：
* 注    意：
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _QUEUE_COMMON_H_
#define _QUEUE_COMMON_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/
//定义循环队列结构体
typedef struct
{
  unsigned int       elelen;   //单个元素的长度
  signed short       front;    //头指针，队非空时指向队头元素
  signed short       rear;     //尾指针，队非空时指向队尾元素的下一个位置
  signed short       bufLen;   //队列的总元素个数
  signed short       elemNum;  //当前队列中的元素的数量
  void* pBuffer;               //循环队列的缓冲区
}StructCirQue;




/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void  InitQueue(StructCirQue* pQue, void* pBuf, signed short len, unsigned int elelen);           //初始化队列
void  ClearQueue(StructCirQue* pQue);                                             //清队列
unsigned char    QueueEmpty(StructCirQue* pQue);                                  //判断队列是否为空，1为空，0为非空
signed short   QueueLength(StructCirQue* pQue);                                   //返回队列中元素个数，即为队列的长度
signed short  EnQueue(StructCirQue* pQue, void* pInput, signed short len);  //入队len个元素
signed short  DeQueue(StructCirQue* pQue, void* pOutput, signed short len); //出队len个元素

#endif
